name: "SentenceClass"
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  data_param {
    source: "examples/language_model/t_train_lmdb"
    batch_size: 500
    backend: LMDB
  }
}
layer {
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  data_param {
    source: "examples/language_model/t_test_lmdb"
    batch_size: 100
    backend: LMDB
  }
}
layer {
  name: "conv1/62X1"
  type: "Convolution"
  bottom: "data"
  top: "conv1/62X1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  convolution_param {
    num_output: 10
    kernel_h: 3
    kernel_w: 300
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv1/62X1_relu"
  type: "ReLU"
  bottom: "conv1/62X1"
  top: "conv1/62X1"
}
layer {
  name: "pool1/1X1"
  type: "Pooling"
  bottom: "conv1/62X1"
  top: "pool1/1X1"
  pooling_param {
    pool: MAX
    kernel_h: 62
    kernel_w: 1
    stride: 1
  }
}
layer {
  name: "fc1"
  type: "InnerProduct"
  bottom: "pool1/1X1"
  top: "fc1"
  param {
    lr_mult: 1
  }
  param {
    lr_mult: 2
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "fc1_relu1"
  type: "ReLU"
  bottom: "fc1"
  top: "fc1"
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc1"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc1"
  bottom: "label"
  top: "loss"
}
